read_verilog -sv ./RTL/counter.v

synth -top counter

splitnets -ports

clean

write_verilog -noexpr -noattr ./rslt/2.5_counter_netlist.v