read_verilog -lib +/simcells.v
read_verilog -sv ./rslt/2.5_counter_netlist.v

hierarchy -check -top counter

write_verilog -noattr ./rslt/3.5_counter_netlist.v