read_verilog -lib +/simcells.v
read_verilog -sv ./rslt/2_counter_netlist.v

hierarchy -check -top counter

write_verilog -noattr ./rslt/3_counter_netlist.v