read_verilog -sv ./rslt/1_counter_RTL.v

synth -top counter

splitnets -ports

clean

write_verilog -noexpr -noattr ./rslt/4.5_counter_netlist.v