# 1. 라이브러리 및 Netlist 로드
read_verilog -lib +/simcells.v
read_verilog -sv ./rslt/1_counter_RTL.v

# 2. 디자인 분석
hierarchy -check -top counter

# 3. 'RTL화'를 위한 최적화 및 복구 과정
# 단순 게이트들을 다시 추상적인 논리 연산(and, or 등)으로 묶어줍니다.
proc
opt -full
freduce
opt_clean

# 4. RTL 스타일로 출력
# -noexpr을 빼고, 가독성을 저해하는 속성들을 제거합니다.
write_verilog -noexpr -noattr -nodec ./rslt/counter_pseudo_rtl.v