# 1. 시뮬레이션용 라이브러리가 아닌, 기본 게이트 정의 라이브러리 로드
read_verilog -lib +/simcells.v

# 2. Netlist 읽기
read_verilog -sv ./rslt/2_counter_netlist.v

# 3. 디자인 분석 및 계층 구조 정리
hierarchy -check -top counter

# 4. 결과 출력
write_verilog -noattr ./rslt/test_recovered.v